[
  {
    "id": 1,
    "title": "Introduction to React",
    "description": "Learn the basics of React, including components, state, and props.",
    "instructor": "Jane Doe",
    "instructorBio": "Jane Doe is a front-end developer with over 10 years of experience in building web applications using React and other modern technologies.",
    "instructorContact": "jane.doe@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/women/1.jpg",
    "duration": "4 weeks",
    "price": 99.99,
    "logoUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTqAr2NU7tqiXwVISV8H_zDTdzFk6CM_RF2DA&s"
  },
  {
    "id": 2,
    "title": "Advanced JavaScript",
    "description": "Dive deeper into JavaScript and master advanced concepts such as ES6+ features, asynchronous programming with Promises and async/await, and advanced functions. This course will enhance your problem-solving skills and prepare you for complex JavaScript applications.",
    "instructor": "John Smith",
    "instructorBio": "John Smith is a seasoned software engineer with a passion for JavaScript and web technologies. He has worked on various high-profile projects and enjoys sharing his knowledge with others.",
    "instructorContact": "john.smith@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/men/1.jpg",
    "duration": "6 weeks",
    "price": 129.99,
    "logoUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/1200px-Unofficial_JavaScript_logo_2.svg.png"
  },
  {
    "id": 3,
    "title": "Mastering CSS",
    "description": "Master advanced CSS techniques with a focus on Flexbox, CSS Grid, and responsive design. Learn how to create flexible layouts, design visually appealing user interfaces, and implement responsive web designs that work seamlessly across different devices and screen sizes.",
    "instructor": "Emily Davis",
    "instructorBio": "Emily Davis is a web designer with a keen eye for detail and a love for creating beautiful, responsive designs. She has been working in the industry for over 8 years and enjoys teaching CSS techniques.",
    "instructorContact": "emily.davis@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/women/2.jpg",
    "duration": "5 weeks",
    "price": 89.99,
    "logoUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQyfXdKH7SrCVpLx-h0j9VSLf7LQxwWgptJNw&s"
  },
  {
    "id": 4,
    "title": "Introduction to Python",
    "description": "Get started with Python programming by exploring the basics of syntax, data types, and control flow. This course covers fundamental concepts such as functions, modules, and error handling, providing a solid foundation for further exploration in Python development.",
    "instructor": "Michael Johnson",
    "instructorBio": "Michael Johnson is a data scientist with extensive experience in Python programming. He specializes in machine learning and data analysis, and has a passion for helping others learn Python.",
    "instructorContact": "michael.johnson@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/men/2.jpg",
    "duration": "4 weeks",
    "price": 109.99,
    "logoUrl": "https://i0.wp.com/junilearning.com/wp-content/uploads/2020/06/python-programming-language.webp?fit=1920%2C1920&ssl=1"
  },
  {
    "id": 5,
    "title": "Backend Development with Node.js",
    "description": "Learn to build server-side applications using Node.js and Express. This course covers API development, middleware, authentication, and database integration. Gain practical experience by creating robust backend services and understanding how to handle server-side logic effectively.",
    "instructor": "Sarah Brown",
    "instructorBio": "Sarah Brown is a backend developer with a strong background in Node.js and server-side technologies. She has built numerous scalable applications and enjoys mentoring upcoming developers.",
    "instructorContact": "sarah.brown@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/women/3.jpg",
    "duration": "6 weeks",
    "price": 119.99,
    "logoUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRZwuIMekZ9OeeXJZj6LPK3A0KFOSjMIyL2yQ&s"
  },
  {
    "id": 6,
    "title": "Data Science with Python",
    "description": "Explore data analysis, visualization, and machine learning using Python libraries such as Pandas, Matplotlib, and Scikit-Learn. Learn to preprocess data, perform statistical analysis, and build predictive models to derive actionable insights from complex datasets.",
    "instructor": "David Wilson",
    "instructorBio": "David Wilson is a data scientist and machine learning expert with a passion for data-driven decision making. He has worked on various projects involving large datasets and advanced analytics.",
    "instructorContact": "david.wilson@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/men/3.jpg",
    "duration": "8 weeks",
    "price": 149.99,
    "logoUrl": "https://api.logoisus.com/wm/633a8dfaf4d1d8f499b1bc38?watermark=2&height=600&width=600"
  },
  {
    "id": 7,
    "title": "Introduction to C++",
    "description": "Get started with C++ programming by learning the fundamentals of syntax, data types, control flow, and object-oriented programming. This course provides a solid foundation for further exploration in C++ development.",
    "instructor": "James Anderson",
    "instructorBio": "James Anderson is a software engineer with a strong background in C++ development. He has worked on various large-scale projects and enjoys teaching others the fundamentals of programming in C++.",
    "instructorContact": "james.anderson@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/men/6.jpg",
    "duration": "5 weeks",
    "price": 109.99,
    "logoUrl": "https://logowik.com/content/uploads/images/911_c_logo.jpg"
  },
  {
    "id": 8,
    "title": "Web Development with Django",
    "description": "Explore web development using Django, a high-level Python web framework. This course covers model-view-controller (MVC) architecture, templating, forms, and deployment, providing you with the skills needed to build secure and scalable web applications.",
    "instructor": "Ethan Green",
    "instructorBio": "Ethan Green is a full-stack developer with a strong background in Django. He has built several web applications using Django and enjoys sharing his knowledge on best practices and efficient development techniques.",
    "instructorContact": "ethan.green@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/men/4.jpg",
    "duration": "8 weeks",
    "price": 129.99,
    "logoUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSPL1tHVVkauQtrSNisTEAwagdg-x6CHH7dkw&s"
  },
  {
    "id": 9,
    "title": "Advanced SQL for Data Analysis",
    "description": "Deepen your SQL skills with advanced techniques for data analysis. This course covers complex queries, subqueries, joins, and data manipulation to help you extract meaningful insights and perform sophisticated data analysis tasks.",
    "instructor": "Olivia Turner",
    "instructorBio": "Olivia Turner is a data analyst with a strong focus on SQL and database management. She has worked with various data analysis tools and enjoys teaching others how to leverage SQL for data-driven decision-making.",
    "instructorContact": "olivia.turner@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/women/5.jpg",
    "duration": "4 weeks",
    "price": 99.99,
    "logoUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTBs7eIyUWImhwDwy6dsCVSJseDFR3lEJSGfQ&s"
  },
  {
    "id": 10,
    "title": "UX/UI Design Fundamentals",
    "description": "Learn the principles of user experience (UX) and user interface (UI) design. This course covers design thinking, wireframing, prototyping, and usability testing to help you create user-centered designs that enhance the user experience.",
    "instructor": "Isabella Clark",
    "instructorBio": "Isabella Clark is a UX/UI designer with a passion for creating intuitive and engaging user interfaces. She has worked on various design projects and enjoys teaching others how to approach design challenges effectively.",
    "instructorContact": "isabella.clark@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/women/6.jpg",
    "duration": "5 weeks",
    "price": 109.99,
    "logoUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRdKvOhH1iOUmdb9mVoQmLkUjbSRNzQ9WaCpQ&s"
  },
  {
    "id": 11,
    "title": "Cybersecurity Essentials",
    "description": "Understand the fundamentals of cybersecurity, including threat identification, risk management, and protective measures. This course covers essential concepts to help you secure systems and data against various cyber threats and vulnerabilities.",
    "instructor": "Liam Harris",
    "instructorBio": "Liam Harris is a cybersecurity expert with extensive experience in protecting systems from cyber threats. He has worked with various organizations to enhance their security posture and enjoys educating others about cybersecurity best practices.",
    "instructorContact": "liam.harris@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/men/5.jpg",
    "duration": "6 weeks",
    "price": 119.99,
    "logoUrl": "https://cdn.vectorstock.com/i/500p/48/11/cyber-security-logo-with-shield-vector-21344811.jpg"
  },
  {
    "id": 13,
    "title": "Advanced C++ Programming",
    "description": "Dive deeper into C++ with advanced topics such as templates, STL (Standard Template Library), multi-threading, and memory management. This course is designed for those who want to master complex C++ features and improve their coding skills.",
    "instructor": "Emma White",
    "instructorBio": "Emma White is an experienced C++ developer with expertise in high-performance computing and software architecture. She has a passion for teaching advanced programming concepts and helping others excel in C++.",
    "instructorContact": "emma.white@example.com",
    "instructorPhoto": "https://randomuser.me/api/portraits/women/7.jpg",
    "duration": "7 weeks",
    "price": 139.99,
    "logoUrl": "https://logowik.com/content/uploads/images/911_c_logo.jpg"
  }

]

